app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index #this will be found at articles itself
		#grab all articles
		@articles = Article.all

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is title"], ["description", "This is desc"], ["created_at", "2017-05-19 20:03:06.711872"], ["updated_at", "2017-05-19 20:03:06.711872"]]
---
	def create
		#render plain: params[:article].inspect #simple code to show what is recieved by the create action
		@article = Article.new(article_params)
		if @article.save #saves the artivle to the database